[Killed] ConditionalExpression
src/routes.ts:14:30
 
         const buildTree = (parentId: number | null = null): any[] => {
             return comments
-                .filter(c => c.parent_id === parentId)
+                .filter(c => true)
                 .map(c => ({
                     ...c,
killedBy: Comments API should fetch comments tree
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BooleanLiteral
src/routes.ts:31:9
 router.post('/comments', async (req, res) => {
     const { content, parent_id }: CreateCommentDto = req.body;
 
-    if (!content) {
+    if (content) {
         return res.status(400).json({ error: 'Content is required' });
     }
killedBy: Comments API should create a new comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400
