[Survived] ConditionalExpression
src/server.ts:17:5
 app.use('/api', routes);
 
 // Only start server if not in test mode
-if (process.env.NODE_ENV !== 'test') {
+if (true) {
     initDb().then(() => {
         app.listen(PORT, () => {
