[Killed] ConditionalExpression
src/database.ts:3:14
 import { Pool } from 'pg';
 
-const host = process.env.DB_HOST || 'localhost';
+const host = true;
 if (!host) {
   throw new Error('Database host is required');
killedBy: Comments API should create a new comment
statusReason: TypeError: (this.host || "").indexOf is not a function

[NoCoverage] BlockStatement
src/database.ts:4:12
 import { Pool } from 'pg';
 
 const host = process.env.DB_HOST || 'localhost';
-if (!host) {
-  throw new Error('Database host is required');
-}
+if (!host) {}
 
 const pool = new Pool({

[Survived] ConditionalExpression
src/database.ts:4:5
 import { Pool } from 'pg';
 
 const host = process.env.DB_HOST || 'localhost';
-if (!host) {
+if (false) {
   throw new Error('Database host is required');
 }

[Killed] ArrowFunction
src/database.ts:16:22
     port: 5432,
 });
 
-export const query = (text: string, params?: any[]) => pool.query(text, params);
+export const query = () => undefined;
 
 export const initDb = async () => {
killedBy: Comments API should create a new comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
src/database.ts:18:35
 
 export const query = (text: string, params?: any[]) => pool.query(text, params);
 
-export const initDb = async () => {
-    await pool.query(`
-    CREATE TABLE IF NOT EXISTS comments (
-      id SERIAL PRIMARY KEY,
-      content TEXT NOT NULL,
-      parent_id INTEGER REFERENCES comments(id),
-      created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
-    );
-  `);
-};
+export const initDb = async () => {};
 
 export const closeDb = () => pool.end();
killedBy: Comments API should create a new comment
statusReason: error: relation "comments" does not exist

[Killed] StringLiteral
src/database.ts:19:22
 export const query = (text: string, params?: any[]) => pool.query(text, params);
 
 export const initDb = async () => {
-    await pool.query(`
-    CREATE TABLE IF NOT EXISTS comments (
-      id SERIAL PRIMARY KEY,
-      content TEXT NOT NULL,
-      parent_id INTEGER REFERENCES comments(id),
-      created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
-    );
-  `);
+    await pool.query(``);
 };
 
killedBy: Comments API should create a new comment
statusReason: error: relation "comments" does not exist

[Killed] ArrowFunction
src/database.ts:29:24
   `);
 };
 
-export const closeDb = () => pool.end();
+export const closeDb = () => undefined;
 
killedBy: Comments API should fetch comments tree
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0
