[Killed] ConditionalExpression
src/server.ts:8:14
 import { initDb } from './database';
 
 const app = express();
-const PORT = process.env.PORT || 3000;
+const PORT = true;
 
 app.use(cors());
killedBy: Comments API should create a new comment
statusReason: error: duplicate key value violates unique constraint "pg_type_typname_nsp_index"

[Killed] ConditionalExpression
src/server.ts:8:14
 import { initDb } from './database';
 
 const app = express();
-const PORT = process.env.PORT || 3000;
+const PORT = false;
 
 app.use(cors());
killedBy: Comments API should create a new comment
statusReason: error: duplicate key value violates unique constraint "pg_type_typname_nsp_index"

[Killed] StringLiteral
src/server.ts:14:9
 app.use(bodyParser.json());
 app.use(express.static('public'));
 
-app.use('/api', routes);
+app.use("", routes);
 
 // Only start server if not in test mode
killedBy: Comments API should create a new comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 404

[Killed] ConditionalExpression
src/server.ts:17:5
 app.use('/api', routes);
 
 // Only start server if not in test mode
-if (process.env.NODE_ENV !== 'test') {
+if (false) {
     initDb().then(() => {
         app.listen(PORT, () => {
killedBy: Comments API should create a new comment
statusReason: error: duplicate key value violates unique constraint "pg_type_typname_nsp_index"

[NoCoverage] BlockStatement
src/server.ts:17:38
 app.use('/api', routes);
 
 // Only start server if not in test mode
-if (process.env.NODE_ENV !== 'test') {
-    initDb().then(() => {
-        app.listen(PORT, () => {
-            console.log(`Server running on http://localhost:${PORT}`);
-        });
-    }).catch(err => console.error('Failed to init DB', err));
-}
+if (process.env.NODE_ENV !== 'test') {}
 
 export default app;

[NoCoverage] BlockStatement
src/server.ts:18:25
 
 // Only start server if not in test mode
 if (process.env.NODE_ENV !== 'test') {
-    initDb().then(() => {
-        app.listen(PORT, () => {
-            console.log(`Server running on http://localhost:${PORT}`);
-        });
-    }).catch(err => console.error('Failed to init DB', err));
+    initDb().then(() => {}).catch(err => console.error('Failed to init DB', err));
 }
 

[NoCoverage] BlockStatement
src/server.ts:19:32
 // Only start server if not in test mode
 if (process.env.NODE_ENV !== 'test') {
     initDb().then(() => {
-        app.listen(PORT, () => {
-            console.log(`Server running on http://localhost:${PORT}`);
-        });
+        app.listen(PORT, () => {});
     }).catch(err => console.error('Failed to init DB', err));
 }

[NoCoverage] ArrowFunction
src/server.ts:22:14
         app.listen(PORT, () => {
             console.log(`Server running on http://localhost:${PORT}`);
         });
-    }).catch(err => console.error('Failed to init DB', err));
+    }).catch(() => undefined);
 }
 
