[Timeout] BlockStatement
src/routes.ts:7:45
 
 const router = Router();
 
-router.get('/comments', async (req, res) => {
-    try {
-        const result = await query('SELECT * FROM comments ORDER BY created_at DESC');
-        const comments: Comment[] = result.rows;
-
-        const buildTree = (parentId: number | null = null): any[] => {
-            return comments
-                .filter(c => c.parent_id === parentId)
-                .map(c => ({
-                    ...c,
-                    children: buildTree(c.id)
-                }));
-        };
-
-        res.json(buildTree(null));
-    } catch (err) {
-        console.error(err);
-        res.status(500).json({ error: 'Internal Server Error' });
-    }
-});
+router.get('/comments', async (req, res) => {});
 
 router.post('/comments', async (req, res) => {

[Timeout] BlockStatement
src/routes.ts:8:9
 const router = Router();
 
 router.get('/comments', async (req, res) => {
-    try {
-        const result = await query('SELECT * FROM comments ORDER BY created_at DESC');
-        const comments: Comment[] = result.rows;
-
-        const buildTree = (parentId: number | null = null): any[] => {
-            return comments
-                .filter(c => c.parent_id === parentId)
-                .map(c => ({
-                    ...c,
-                    children: buildTree(c.id)
-                }));
-        };
-
-        res.json(buildTree(null));
-    } catch (err) {
+    try {} catch (err) {
         console.error(err);
         res.status(500).json({ error: 'Internal Server Error' });

[Killed] BlockStatement
src/routes.ts:12:70
         const result = await query('SELECT * FROM comments ORDER BY created_at DESC');
         const comments: Comment[] = result.rows;
 
-        const buildTree = (parentId: number | null = null): any[] => {
-            return comments
-                .filter(c => c.parent_id === parentId)
-                .map(c => ({
-                    ...c,
-                    children: buildTree(c.id)
-                }));
-        };
+        const buildTree = (parentId: number | null = null): any[] => {};
 
         res.json(buildTree(null));
killedBy: Comments API should fetch comments tree
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] MethodExpression
src/routes.ts:13:20
         const comments: Comment[] = result.rows;
 
         const buildTree = (parentId: number | null = null): any[] => {
-            return comments
-                .filter(c => c.parent_id === parentId)
+            return comments
                 .map(c => ({
                     ...c,
killedBy: Comments API should fetch comments tree
statusReason: error: duplicate key value violates unique constraint "pg_type_typname_nsp_index"

[Killed] ConditionalExpression
src/routes.ts:14:30
 
         const buildTree = (parentId: number | null = null): any[] => {
             return comments
-                .filter(c => c.parent_id === parentId)
+                .filter(c => false)
                 .map(c => ({
                     ...c,
killedBy: Comments API should fetch comments tree
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
src/routes.ts:14:30
 
         const buildTree = (parentId: number | null = null): any[] => {
             return comments
-                .filter(c => c.parent_id === parentId)
+                .filter(c => c.parent_id !== parentId)
                 .map(c => ({
                     ...c,
killedBy: Comments API should fetch comments tree
statusReason: error: duplicate key value violates unique constraint "pg_type_typname_nsp_index"

[Killed] ArrowFunction
src/routes.ts:15:22
         const buildTree = (parentId: number | null = null): any[] => {
             return comments
                 .filter(c => c.parent_id === parentId)
-                .map(c => ({
-                    ...c,
-                    children: buildTree(c.id)
-                }));
+                .map(() => undefined);
         };
 
killedBy: Comments API should fetch comments tree
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Timeout] BlockStatement
src/routes.ts:22:19
         };
 
         res.json(buildTree(null));
-    } catch (err) {
-        console.error(err);
-        res.status(500).json({ error: 'Internal Server Error' });
-    }
+    } catch (err) {}
 });
 

[Timeout] BlockStatement
src/routes.ts:28:46
     }
 });
 
-router.post('/comments', async (req, res) => {
-    const { content, parent_id }: CreateCommentDto = req.body;
-
-    if (!content) {
-        return res.status(400).json({ error: 'Content is required' });
-    }
-
-    try {
-        const result = await query(
-            'INSERT INTO comments (content, parent_id) VALUES ($1, $2) RETURNING *',
-            [content, parent_id || null]
-        );
-        res.status(201).json(result.rows[0]);
-    } catch (err) {
-        console.error(err);
-        res.status(500).json({ error: 'Internal Server Error' });
-    }
-});
+router.post('/comments', async (req, res) => {});
 
 export default router;

[Killed] StringLiteral
src/routes.ts:28:13
     }
 });
 
-router.post('/comments', async (req, res) => {
+router.post("", async (req, res) => {
     const { content, parent_id }: CreateCommentDto = req.body;
 
killedBy: Comments API should create a new comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 404

[Killed] BlockStatement
src/routes.ts:31:19
 router.post('/comments', async (req, res) => {
     const { content, parent_id }: CreateCommentDto = req.body;
 
-    if (!content) {
-        return res.status(400).json({ error: 'Content is required' });
-    }
+    if (!content) {}
 
     try {
killedBy: Comments API should return 400 if content is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
src/routes.ts:31:9
 router.post('/comments', async (req, res) => {
     const { content, parent_id }: CreateCommentDto = req.body;
 
-    if (!content) {
+    if (true) {
         return res.status(400).json({ error: 'Content is required' });
     }
killedBy: Comments API should create a new comment
statusReason: error: duplicate key value violates unique constraint "pg_type_typname_nsp_index"

[Timeout] BlockStatement
src/routes.ts:35:9
         return res.status(400).json({ error: 'Content is required' });
     }
 
-    try {
-        const result = await query(
-            'INSERT INTO comments (content, parent_id) VALUES ($1, $2) RETURNING *',
-            [content, parent_id || null]
-        );
-        res.status(201).json(result.rows[0]);
-    } catch (err) {
+    try {} catch (err) {
         console.error(err);
         res.status(500).json({ error: 'Internal Server Error' });

[Killed] ConditionalExpression
src/routes.ts:38:23
     try {
         const result = await query(
             'INSERT INTO comments (content, parent_id) VALUES ($1, $2) RETURNING *',
-            [content, parent_id || null]
+            [content, true]
         );
         res.status(201).json(result.rows[0]);
killedBy: Comments API should create a new comment
statusReason: error: duplicate key value violates unique constraint "pg_type_typname_nsp_index"

[Killed] ConditionalExpression
src/routes.ts:38:23
     try {
         const result = await query(
             'INSERT INTO comments (content, parent_id) VALUES ($1, $2) RETURNING *',
-            [content, parent_id || null]
+            [content, false]
         );
         res.status(201).json(result.rows[0]);
killedBy: Comments API should create a new comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
src/routes.ts:41:19
             [content, parent_id || null]
         );
         res.status(201).json(result.rows[0]);
-    } catch (err) {
-        console.error(err);
-        res.status(500).json({ error: 'Internal Server Error' });
-    }
+    } catch (err) {}
 });
 
killedBy: API Error Handling should return 500 when database query fails during POST /api/comments
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
